run/conjugateBattery/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outsideSurface
    {
        type            patch;
        nFaces          4232;
        startFace       82520;
    }
    lithiumInterface
    {
        type            regionCouple;
        nFaces          3200;
        startFace       86752;
        shadowRegion    region0;
        shadowPatch     liquidToLithiumInterface;
        zone            lithiumInterfaceZone;
        attached        off;
        master          off;
        isWall          off;
        bridgeOverlap   off;
    }
    steelInterface
    {
        type            regionCouple;
        nFaces          2600;
        startFace       89952;
        shadowRegion    region0;
        shadowPatch     liquidToSteelInterface;
        zone            steelInterfaceZone;
        attached        off;
        master          off;
        isWall          off;
        bridgeOverlap   off;
    }
    topLithium
    {
        type            patch;
        nFaces          1600;
        startFace       92552;
    }
    topSurface
    {
        type            patch;
        nFaces          544;
        startFace       94152;
    }
)


// ************************************************************************* //
